# -**- encoding: utf-8 -**-

textsStart     = " - أهلا بك عزيزي المشرف في لوحة التحكم\n - يمكنك التحكم بي بواسطة الأزرار الظاهرة أدناه 👇\n\n👨‍💻 By : [Monzer ](https://t.me/J_P_T )";

buttonsAdder = {"MoveM":' - بدء عملية نقل أعضاء',"JoinM":' رشق أعضاء',"AddViews":" رشق مشاهدات","CheckAccounts":' فحص الحسابات'};

extraButtons   = {"Cancle":' إلغاء العملية',"Stop":' إيقاف النقل',"Start":' بدء النقل',"Leaves":'🚶 مغادرة المجموعتين','MoveNormal':' نقل ظاهر','MovePro':' نقل مخفي','Back':' الرجوع من هنا','Leave': " مغادرة مجموعة"}



AdderTexts     = {
	"selectMoveMode":" **- قم بتحديد نوع عملية نقل الأعضاء **\n **- للنقل من مجموعة مخفي أعضاءها قم بتحديد نقل مخفي **\n  **- للنقل من مجموعة ظاهر أعضاءها قم بتحديد نقل ظاهر **",
	"sendURLfrom":" **- تم تجهيز وضع النقل**\n **- قم بإرسال رابط المجموعة التي سيتم نقل الأعضاء منها**\n **- إرسل رابطا مضافا إليه https او http**\n **- مثال بسيط ------------------- **\nhttps://t.me/XXXfakhm",
	"sendURLto":" **- يتم الآن جمع البيانات**\n\n **- قم بإرسال رابط المجموعة التي سيتم نقل الأعضاء إليها من المجموعة السابقة**\n **- إرسل رابطا مضافا إليه https او http**\n **- مثال بسيط -------------------…… **\nhttps://t.me/XXXfakhm",
	"sendCount":" - حسنا عزيزي \n **- قم بإرسال عدد الأعضاء الذين سيتم نقلهم من المجموعة** ++FROM++ إلى المجموعة ++TO++ \n **- إرسل أعدادا صحيحة فقط**\n **- مثال بسيط «« 100 »»**",
	"sendTime":" - حسنا عزيزي \n **- قم بإرسال الفاصل الزمني بين كل عملية  إضافة / ثانية\n **- إرسل أعدادا صحيحة فقط من 1 إلى 59**\n **- مثال بسيط «« 3 »»**",
	"Joining":" **- تم حفظ بيانات النقل كالتالي **\n\n **- المجموعة المضيفة:- ** ++FROM++\n **- المجموعة المستضيفة:- ** ++TO++\n\n **- العدد المطلوب :- «« ++COUNT++ »» عضو\n ** الفاصل الزمني بين الإضافات :- «« ++TIME++ »»\n\n **- يتم الآن الإنضمام إلى المجموعتين إستعدادا لتخزين الأعضاء.....**",
	"Joined":" **تم الإنضمام للمجموعة بنجاح ، سيتم بدء النقل حال تخزين الأعضاء....**",
	"Stored":" **- تم الإنتهاء من تخزين الأعضاء**\n ** عدد الأعضاء الذين تم تخزينهم على السيرفر «« ++CT++ »» عضو\n** - حالة النقل :- ++STATUS++ **\n\n ** لبدء عملية النقل إضغط على الزر بالإسفل** ",
	"Moving":" * - يتم الآن إضافة الأعضاء.... الرجاء عدم التخبيص بالسيرفر*\n\n *- العدد المطلوب :- «« ++REQ++ »» عضو*\n *- عدد الأعضاء على السيرفر :- «« ++COUNT++ »»*\n\n *- المجموعة المضيفة :-* [++FROM++]\n *- المجموعة المستضيفة :-* [++TO++]\n *- تأخير النقل :- ++STATUS++ ثوان*\n\n\n *- تم الإضافة حتى الآن «« ++ADDED++ »» عضو*\n *- تبقى من الأعضاء لإضافتهم «« ++DASH++ »» عضو*\n *- لا يمكن إضافة «« ++DONT++ »» عضو*\n\n *- تم إستخدام «« ++USED++ »» حسابا من أصل «« ++ALL++ »» حساب *\n *- عدد الحسابات المحظورة مؤقتا «« ++BTIME++ »» حساب*\n\n *- لإيقاف عملية النقل إضغط على الزر بالإسفل *",
	"MovingStopped":" * - تم إيقاف النقل بنجاح.... *\n\n *- العدد المطلوب :- «« ++REQ++ »» عضو*\n *- عدد الأعضاء على السيرفر :- «« ++COUNT++ »»*\n\n *- المجموعة المضيفة :-* [++FROM++]\n *- المجموعة المستضيفة :-* [++TO++]\n *- تأخير النقل :- ++STATUS++ ثوان*\n\n\n *- تم الإضافة حتى الآن «« ++ADDED++ »» عضو*\n *- تبقى من الأعضاء لإضافتهم «« ++DASH++ »» عضو*\n *- لا يمكن إضافة «« ++DONT++ »» عضو*\n\n *- تم إستخدام «« ++USED++ »» حسابا من أصل «« ++ALL++ »» حساب *\n *- عدد الحسابات المحظورة مؤقتا «« ++BTIME++ »» حساب*\n\n *- للعودة إلى لوحة التحكم إضغط على الزر بالإسفل *",
	"Stopped":" تم الإنتهاء من عملية النقل بنجاح\nمعلومات النقل في الرسالة التي هذه الرسالة رد عليها ",
	"ViewingSc":" *- تم ضخ «++DONE++» *\n *- تبقى «++DIS++» *"
}

ExtraTexts     = {
	'serverIsBusy':" **- السيرفر مشغول في الوقت الحالي **\n **- لتفريغ السيرفر إضغط على الزر بالإسفل **",
	'supportCHGP': " **- تمكنك هذه الميزة من التحكم بالحسابات المرتبطة بالبوت لجعلها تنضم في مجموعات أو قنوات **\n\n **- قم بإرسال رابط القناة أو المجموعة التي سيتم انضمام الحسابات إليها .....**\n\n **- يجب أن يبدأ الرابط ببروتوكول ك** http **أو** https\n\n مثلا https://t.me/XXXfakhm",
	'MembersStored': " *- تم تخزين الأعضاء بنجاح *\n *- العدد «« ++C++ »» عضو *\n *-لبدء عملية النقل إضغط على الزر بالإسفل *",
	'StopedMove': " - تم إيقاف النقل بنجاح",
	'Storing': " *- تم الإنضمام إلى المجموعتين بنجاح *\n *- أيدي المجموعتين لاستخدامها عند المغادرة *\n\n *- المجموعة التي يتم النقل منها* `++FROM++`\n *- المجموعة التي يتم النقل إليها* `++TO++`\n\n *- يتم الآن تخزين الأعضاء...... سيتم إشعارك حال الإنتهاء من هذه العملية.*",
	'Leave': " **- حسنا عزيزي ، قم بإرسال أيدي المجموعة التي سيتم مغادرة الحسابات منها ** ",
	'Leaved': " - تم المغادرة إن كانت المجموعة تحوي حساباتنا.",
	'ViewURL': " **- هذه الميزة تعمل مع القنوات العامة فقط **\n **- الآن قم بإرسال رابط الرسالة التي سيتم مشاهدتها..**",
	'ViewCount': " **- فضلا قم بإرسال عدد الحسابات التي ستشاهد الرسالة **",
	'Viewing': " - جار الآن ضخ المشاهدات للرسالة.",
	'StartedMove': " **- تم بدء النقل الآن .....**\n **- إليك المعلومات في الرسالة التالية **"
}

#print(AdderTexts["Stored"]);